# 划分vlan

## 创建valn

```shell
Switch# configure terminal
Switch(config)# vlan 10
Switch(config-vlan)# name test
Switch(config-vlan)# end 
```

## 接口加入vlan

```shell
Switch# configure terminal
Switch(config)# interface fastethernet 0/10
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# end
```

将一组接口加入某一个VLAN

```shell
Switch(config)#interface range fastethernet 0/1-8，0/15，0/20
Switch(config-if-range)# switchport access vlan 20
```

连续接口 0/1-8，不连续接口用逗号隔开，但一定要写明模块编号

# Vlan Trunk

只要是需要通过多个vlan网段的接口都需要trunk

一个交换机如果通过trunk通过多个vlan，就需要划分多个vlan

把Fa0/1配成Trunk口

```shell
Switch# configure terminal
Switch(config)# interface fastethernet0/1
Switch(config-if)# switchport mode trunk
```

把端口Fa0/20 配置为Trunk端口，但是不包含VLAN 2：

```shell
Switch(config)# interface fastethernet 0/20
Switch(config-if)# switchport trunk allowed vlan remove 2
Switch(config-if)# end
```

## 链路聚合

```shell
Switch>en
Switch#conf ter
# 配置物理接口
Switch(config)#int range fa0/1-2
Switch(config-if-range)#sw mode trunk
# 物理接口加入链路聚合口
Switch(config-if-range)#channel-group 1 mode active
# 创建链路聚合口
Switch(config)#int port-channel 1
Switch(config-if)#sw mode trunk
```

# Vlan 间路由

交换机切换路由模式

```shell
Switch(config)# ip routing
# 之后就可以进入端口设置为trunk,可能会提示是Auto模式
Switch(config)#int fa0/2
Switch(config-if)#sw mode trunk
Switch(config-if)#vlan 71
Switch(config-vlan)#int vlan 71
Switch(config-if)#ip addr 192.168.71.1 255.255.255.0
```

切换接口为三层口

```shell
Switch(config)#int fa0/1
Switch(config-if)#no switchport
# 就可以分配ip了
Switch(config-if)#ip addr 192.168.101.1 255.255.255.0
Switch(config-if)#no shutdown
```

# 路由器配置

## 时钟设置

```shell
Router(config)# int se0/3/0
clock rate 64000
```

## 端口ip配置

```shell
Router >enable
Router# config  terminal
Router(config) # interface ethernet 0
Router(config-if) # ip address 192.168.0.1  255.255.255.0
Router(config-if) # no showdown
Router(config-if) # end 
```

## 划分子接口

```shell
Router(config)#int fa0/1.151
Router(config-subif)#encapsulation dot1Q  151
Router(config-subif)#ip addr 192.168.151.1 255.255.255.0
Router(config-subif)#no shutdown
```

## Rip协议

```shell
Switch>en
Switch#conf ter
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#router rip
Switch(config-router)#network 192.168.71.0
Switch(config-router)#network 192.168.81.0
Switch(config-router)#network 192.168.91.0
Switch(config-router)#network 192.168.101.0	
Switch(config-router)#version 2
Switch(config-router)#no auto-summary
```

## OSPF协议

```shell
Router(config)#router ospf 1
Router(config-router)#network 172.16.5.0 0.0.0.255 area 0
Router(config-router)#network 172.16.2.0 0.0.0.255 area 0
Router(config-router)#end
```

## 静态路由

目标地址,掩码,下一跳

```shell
Router(config)#ip route 192.168.71.0 255.255.255.0 192.168.91.1
```

# 备份与回复

## 路由器

在路由器上配置fastethernet1/0端口

```shell
routerA(config)# interface fastethernet1/0
routerA(config-if)# ip address 192.168.0.138 255.255.255.0
routerA(config-if)# no shutdown
routerA# ping 192.168.0.137 
```

备份路由器配置

```shell
routerA# copy running-config tftp
Address or name of remote host[ ]? 192.168.0.137 !输入tftp服务器的IP
Destination filename [ ]?config.text
或者使用
routerA＃copy startup-config tftp 
```

恢复路由器配置

```shell
routerA# delete flash: config.text !删除路由器原有配置信息
routerA# copy tftp startup-config !恢复配置到路由器的初始配置文件中
Address or name of remote host[ ]? 192.168.0.137 !输入tftp服务器的IP
Destination filename [ ]?config.text
Accessing tftp://192.168.0.137/config.text…
Write file to flash successfully!
routerA# copy startup-config running-config
```

## 交换机

在交换机上配置管理接口IP地址

```shell
switchA（config）# interface vlan 1 !进入交换机管理接口配置模式
switchA（config-if）# ip address 192.168.0.138 255.255.255.0 !配置交换机管理接口IP
switch(config-if) # no shutdown
```

备份交换机配置文件

```shell
switchA# copy running-config starup-config !保存交换机的当前配置
switchA # copy startup-config tftp !备份交换机配置到tftp服务器
Address of remote host [ ] ?192.168.0.137
Destination filename [ config.text ]?
```

从主机恢复交换机配置

```shell
switchA # delete flash:config.text !删除原有的配置文件
switchA# copy tftp startup-config !加载配置到交换机的初始配置文件中
Source filename [ ] ?config.text
Address of remote host [ ] 192.168.0.137
%success :Transmission success ,file lentgh…   
```

重启

```shell
switchA# reload 
```

